[
    {
        "title": "เรียนวิศวะคอมพิวเตอร์?",
        "subtitle": " วิศวกรรมคอมพิวเตอร์จะเน้นด้านการออกแบบฮาร์ดแวร์",
        "image_url": "https://raw.githubusercontent.com/omegabuz/tryAPI/main/img_upload/monkeyguitar.png",
        "detail": "วิศวกรรมคอมพิวเตอร์ (อังกฤษ: computer engineering) เป็นศาสตร์ที่เกี่ยวข้องกับการออกแบบและสร้างเครื่องหรือระบบคอมพิวเตอร์ และ ระบบที่ใช้คอมพิวเตอร์ ศาสตร์นี้เกี่ยวข้องกับการศึกษาทางด้านฮาร์ดแวร์ ซอฟต์แวร์ การสื่อสาร และความเกี่ยวเนื่องระหว่างเรื่องทั้งสาม หลักสูตรการเรียนมุ่งเน้นทางด้าน ทฤษฎี กฎ และ การฝึกฝนปฏิบัติของทางด้านวิศวกรรมไฟฟ้า และ คณิตศาสตร์ และวิทยาศาสตร์รวมถึงการประยุกต์เข้ากับปัญหาทางด้านการออกแบบคอมพิวเตอร์ และ อุปกรณ์ที่ใช้คอมพิวเตอร์\n\nวิศวกรคอมพิวเตอร์ ศึกษาการออกแบบระบบฮาร์ดแวร์ดิจิทัล ซึ่งรวมถึงระบบการสื่อสาร องค์ประกอบของคอมพิวเตอร์ และอุปกรณ์ที่ประกอบด้วยคอมพิวเตอร์ วิศวกรคอมพิวเตอร์จะเรียนการพัฒนาซอฟต์แวร์ โดยมุ่งเน้นเกี่ยวกับซอฟต์แวร์สำหรับอุปกรณ์ดิจิทัล และ การสร้างส่วนต่อประสานระหว่างผู้ใช้งานซอฟต์แวร์ และ ระหว่างอุปกรณ์ต่าง ๆ รวมทั้งความรู้ทางด้านวิศวกรรมที่ดีด้วย"
    },
    {
        "title": "หมามีกี่ขา?",
        "subtitle": "มีหลายขา วิ่ง วิ่ง วิ่ง เห่า",
        "image_url": "https://raw.githubusercontent.com/omegabuz/tryAPI/main/img_upload/dogrun.jpg",
        "detail": "วิวัฒนาการด้านโมเลกุลของหมาชี้ให้เห็นว่าหมาเลี้ยงนั้น (Canis lupus familiaris) สืบทอดมาจากจำนวนประชากรหมาป่า (Canis lupus) เพียงตัวเดียวหรือหลายตัว สะท้อนให้เห็นถึงการตั้งชื่อพวกมัน หมาสืบทอดจากหมาป่าและหมาธรรมดาสามารถผสมข้ามพันธุ์กับหมาป่าได้ด้วย\n\nความสัมพันธ์ระหว่างมนุษย์กับหมานั้นถูกฝังลึกในด้านโบราณคดีและหลักฐานที่ตรงกันชี้ให้เห็นช่วงเวลาของการทำให้หมาเชื่องในยุคหินใหม่ ใกล้ ๆ กับขอบเขตของช่วงเพลสโตซีนและโฮโลซีน ในระหว่าง 17,000 - 14,000 ปีมาแล้ว ซากกระดูกฟอสซิลและการวิเคราะห์ยีนของหมาในยุคอดีตกับปัจจุบัน และประชากรหมาป่ายังไม่ถูกค้นพบ หมาทั้งหมดสืบอายุอาจเกิดจากเหตุการณ์ที่ทำให้เชื่องด้วยตัวเองหรือไม่ก็ได้ถูกทำให้เชื่องด้วยตัวมันเองในพื้นที่มากกว่าหนึ่งพื้นที่ หมาที่ถูกเลี้ยงให้เชื่องแล้วอาจจะผสมข้ามพันธุ์กับประชากรหมาป่าที่อยู่ในถิ่นนั้น ๆ ในหลาย ๆ โอกาส กระบวนการนี้รู้จักในทางทางพันธุศาสตร์ว่า อินโทรเกรสชัน (Introgression)"
    },
    {
        "title": "ถ้าโรงเรียนไม่ปลอกภัย?",
        "subtitle": "แปลว่าต้องมีอะไรอยู่ในโรงเรียน",
        "image_url": "https://raw.githubusercontent.com/omegabuz/tryAPI/main/img_upload/nakreon.png",
        "detail": "ทั้ง ๆ ที่สถานศึกษาควรเป็นพื้นที่ปลอดภัย แต่ทำไมปัญหาส่วนใหญ่ที่เกิดขึ้นมักมีต้นตอมาจากในรั้วสถานศึกษา?\n\nหากพูดถึงปัญหาในรั้วสถานศึกษา คงแยกย่อยออกมาได้มากมายหลายประเด็น ทั้งระบบการศึกษา คุณครู บุคลากร รวมถึงตัวเด็กนักเรียน หนึ่งในปัญหาที่พบได้มากในปัจจุบัน คงหนีไม่พ้น การบูลลี่ในโรงเรียน\n\nบูลลี่ (Bully) คือ การกลั่นแกล้งที่แสดงออกด้วยคำพูด หรือ พฤติกรรมที่ก้าวร้าวต่อผู้อื่น ซึ่งมักเกิดขึ้นในสังคมที่มีช่องว่างระหว่างผู้ที่มีพละกำลัง หรืออำนาจมากกว่าแสดงออกแก่ผู้ที่อ่อนแอกว่า และมีโอกาสเกิดขึ้นซ้ำ ๆ โดยการบูลลี่ในโรงเรียนนั้นพบได้มาก นำไปสู่ปัญหาสภาพทางจิตใจที่ร้ายแรงได้ในอนาคต"
    },
    {
        "title": "จีนส่อเปลี่ยนความสัมพันธ์รัสเซีย?",
        "subtitle": "เป็นมิตรต่อไป ตราบใดที่ไม่ถูกคว่ำบาตร",
        "image_url": "https://raw.githubusercontent.com/omegabuz/tryAPI/main/img_upload/xiandpu.png",
        "detail": "หลังจากที่ประธานาธิบดีรัสเซีย วลาดิเมียร์ ปูติน ประกาศระดมกำลังพลสำรองเข้าไปเสริมทัพ ปฏิบัติการพิเศษทางทหารในยูเครน ทั่วโลกต่างจับตาไปที่ สี จิ้นผิง และประเทศจีน พันธมิตรคนสำคัญของรัสเซีย ว่าจะมีปฏิกิริยาใดต่อการตัดสินใจนี้\n\nแน่นอนว่า เมื่อพิจารณาจากท่าทีที่ผ่านมาของจีนที่ไม่ได้ประณามการรุกรานยูเครนของรัสเซีย แต่ในขณะเดียวกันก็ไม่ได้สนับสนุน หลายคนน่าจะเดาได้ว่า สิ่งที่จีนบอกคงไม่พ้น การเรียกร้องให้หยุดยิงและดำเนินการเจรจา\n\nหวัง เหวินปิน โฆษกกระทรวงการต่างประเทศของจีน กล่าวว่า เราขอเรียกร้องให้ทุกฝ่ายที่เกี่ยวข้องยุติการยิงและดำเนินการเจรจา ปรึกษาหารือและหาแนวทางแก้ไขที่รองรับข้อกังวลด้านความปลอดภัยที่ถูกต้องตามกฎหมายของทุกฝ่ายโดยเร็วที่สุด\n\nเขาเสริมว่า เรายืนกรานเสมอว่า ควรเคารพอธิปไตยและบูรณภาพแห่งดินแดนของทุกประเทศ ควรปฏิบัติตามวัตถุประสงค์และหลักการของกฎบัตรสหประชาชาติ ควรพิจารณาข้อกังวลด้านความปลอดภัยที่ถูกต้องตามกฎหมายของทุกประเทศอย่างจริงจัง และความพยายามทั้งหมดที่เอื้อต่อการแก้ไขปัญหาวิกฤตการณ์อย่างสันติควรได้รับการสนับสนุน\n\nปูตินประกาศการระดมพลเมื่อต้นวันพุธ และให้คำมั่นว่าจะใช้ ทุกวิถีทางที่มีอยู่ เพื่อปกป้องดินแดนรัสเซีย หลังจากที่ภูมิภาคที่มอสโกยึดครองของยูเครนประกาศการลงประชามติผนวก\n\nจีนเรียกร้องให้มุกฝ่ายที่เกี่ยวข้องแก้ไขความแตกต่างอย่างเหมาะสมผ่านการเจรจาและการปรึกษาหารือ และเรายินดีที่จะทำงานร่วมกับประชาคมระหว่างประเทศเพื่อดำเนินบทบาทที่สร้างสรรค์ในการขจัดสถานการณ์ที่ทวีความรุนแรงขึ้น หวัง เหวินปิน กล่าว\n\nผู้เชี่ยวชาญประเมินว่า ถึงอย่างไร สี จิ้นผิง ไม่น่าจะทิ้ง เพื่อนเก่า อย่างปูติน แม้ว่าการตัดสินใจของผู้นำรัสเซียในการส่งทหารอีกหลายแสนนายไปยังยูเครนและการขู่ด้วยอาวุธนิวเคลียร์อาจบ่อนทำลายความร่วมมือระหว่างทั้งสองประเทศ\n\nปัญหาสำคัญของจีนคือ จะต้องพยายามรักษาจุดยืนของจีนที่ ยังคงเป็นมิตรกับรัสเซีย แต่ไม่มากไปจนถูกตะวันตกคว่ำบาตร\n\nสี จิ้นผิง และปูติน ใกล้ชิดกันมากขึ้นในช่วงไม่กี่ปีที่ผ่านมา เนื่องจากมีทัศนคติที่ตรงกันในเรื่องการเฝ้าระวังชาติตะวันตก แต่จีนระมัดระวังที่จะไม่ให้การสนับสนุนโดยตรงใด ๆ แก่รัสเซียที่อาจก่อให้เกิดการคว่ำบาตรจากตะวันตก\n\nเดิมทีจีนได้รับผลกระทบทางเศรษฐกิจและสังคมจากการแพร่ระบาดของโควิด-19 และมาตรการที่เข้มงวดอยู่แล้วจนประชาชนในประเทศไม่พอใจ ดังนั้นเมื่อมีศึกในจีนจึงไม่น่าจะต้องการเปิดศึกนอกอีก\n\nเฮนรี หวัง ฮุยเหยา ผู้ก่อตั้ง Beijing Think Tank สถาบันคลังสมองในจีน กล่าวว่า “จีนไม่สนับสนุนสงคราม ไม่สนับสนุนความขัดแย้ง นั่นชัดเจนมากตั้งแต่เริ่มต้น”\n\nเขาบอกว่า การสั่งระดมกำลังพลไม่น่าจะส่งผลกระทบต่อจีนหรือเปลี่ยนความสัมพันธ์ระหว่างสองประเทศ อีกทั้งความร่วมมือทางเศรษฐกิจระหว่างทั้งคู่มีแนวโน้มที่จะพัฒนาไปอีกขั้น เนื่องจากจีนได้ประโยชน์จากการนำเข้าทรัพยากรพลังงานของรัสเซียในราคาถูกได้ ในขณะที่รัสเซียชดเชยความสูญเสียทางเศรษฐกิจที่เกิดจากการคว่ำบาตรของตะวันตก\n\nสตีฟ ชาง ผู้อำนวยการสถาบันจีนศึกแห่ง SOAS University of London กล่าวว่า สิ่งที่สำคัญที่สุดสำหรับ สี จิ้นผิง คือการที่ปูตินไม่ล้มเหลวหรือการรุกรานสร้างความเสียหายเพิ่มเติมแก่จีน โดยเฉพาะอย่างยิ่งในด้านเศรษฐกิจ นโยบายต่างประเทศหลักของ สี จิ้นผิง คือผลประโยชน์จีนต้องมาก่อน\n\nหากพูดกันโดยง่าย สิ่งที่จีนต้องการ คือเพื่อนที่จะช่วยกันเสริมสร้างความแข็งแกร่งให้กับจีนได้ ไม่ใช่จุดอ่อนที่จะมาฉุดรั้งการฟื้นตัวและพัฒนาของจีน\n\nสือ หยินหง ศาสตราจารย์ด้านความสัมพันธ์ระหว่างประเทศ มหาวิทยาลัยเหรินหมิน กล่าวว่า จีนไม่มีทางเลือกอื่นนอกจากจะเว้นระยะห่างจากปูตินเพียงเล็กน้อย เนื่องจากสงครามที่ทวีความรุนแรงขึ้น ความแข็งกร้าว และแผนการผนวกดินแดนของเขา และภัยคุกคามเรื่องสงครามนิวเคลียร์ จีนไม่ต้องการให้เพื่อนที่ไม่เชื่อฟังคนนี้ต่อสู้ เพราะสนามรบนี้ไม่ใช่สิ่งที่จีนสามารถควบคุมได้เลย\n\nไบรอัน ฮาร์ต จากศูนย์การศึกษายุทธศาสตร์และการศึกษาระหว่างประเทศ กล่าวว่า ผมไม่คิดว่าเราจะเห็นความแตกแยกครั้งใหญ่ระหว่างรัสเซียและจีน ผมมองว่านี่เป็นความต่อเนื่องของจีนที่พยายามจะผูกมิตรรัสเซีย โดยจีนจะสนับสนุนรัสเซียต่อไปเท่าที่สามารถทำได้ตราบเท่าที่มันไม่ขัดต่อผลประโยชน์ของจีนเอง\n\nจนถึงตอนนี้ จีนได้พยายามหลีกเลี่ยงการกระทำที่จะล้ำเส้นการคว่ำบาตรของชาติตะวันตกอย่างระมัดระวัง เช่น ให้ความช่วยเหลือทางทหารโดยตรงแก่มอสโก เพียงแต่ช่วยพยุงเศรษฐกิจรัสเซียที่ย่ำแย่ด้วยการซื้อเชื้อเพลิงและพลังงานรัสเซียในราคาต่อรอง\n\nการนำเข้าถ่านหินรัสเซียของจีนในเดือน ส.ค. เพิ่มขึ้น 57% จากช่วงเดียวกันของปีที่แล้ว ซึ่งแตะระดับสูงสุดในรอบ 5 ปี ส่วนการนำเข้าน้ำมันดิบรัสเซียก็เพิ่มขึ้น 28% จากปีก่อนหน้าเช่นกัน\n\nหากจะพูดอย่างใจจืดใจดำ ก็ต้องบอกว่า จีนต้องการรัสเซียในฐานะพันธมิตรต่อต้านตะวันตกและโดยเฉพาะสหรัฐฯ แต่หากวันใดที่รัสเซียเริ่มจะ ลาก จีนให้จมดิ่งด้วยกัน ก็เป็นไปได้ว่าจีนจะตัดสินใจ สละ เพื่อนเก่าเพื่อนแก่ทิ้ง เพื่อผลประโยชน์ของจีน\n\nเรื่องนี้ดู ๆ แล้วก็ไม่พ้นทำให้นึกถึงถ้อยความที่ว่า ไม่มีมิตรแท้และศัตรูที่ถาวร มีเพียงผลประโยชน์เท่านั้นที่ถาวร"
    },
    {
        "title": "โลกกลมจริงหรือ?",
        "subtitle": "เป็นแค่เรื่องตลกหรือการหลอกลวง",
        "image_url": "https://raw.githubusercontent.com/omegabuz/tryAPI/main/img_upload/flatearth.jpg",
        "detail": "หนึ่งในทฤษฎีสมคบคิดที่โด่งดังมากที่สุดในปัจจุบัน เห็นจะได้แก่ความเชื่อเรื่องโลกแบน ซึ่งมีผู้คนจำนวนไม่น้อยในหลายประเทศปักใจเชื่อว่า โลกของเราไม่ได้เป็นทรงกลมตามที่นักวิทยาศาสตร์ได้พิสูจน์ไว้ แต่แบนราบเหมือนจานหรือแผ่นดิสก์ ตามที่คัมภีร์เก่าแก่ทางศาสนาได้ระบุไว้ต่างหาก\n\nแม้นักปราชญ์ชาวกรีกจะสามารถพิสูจน์ได้ตั้งแต่ 300 ปีก่อนคริสตกาลแล้วว่า โลกมีสัณฐานเป็นทรงกลมและยังทราบขนาดของเส้นรอบวงอีกด้วย แต่ชาวสมาคมโลกแบนกลับรื้อฟื้นความเชื่อแบบโบราณขึ้นมาอีกครั้งในช่วงทศวรรษ 1950 โดยกลุ่มคนเหล่านี้มีความเคลื่อนไหวมากขึ้นในช่วงไม่กี่ปีที่ผ่านมา\n\nตามแนวคิดโลกแบนนั้น จุดศูนย์กลางของโลกอยู่ที่ขั้วโลกเหนือ ส่วนทวีปแอนตาร์กติกาซึ่งควรจะเป็นที่ตั้งของขั้วโลกใต้ กลับมีลักษณะเป็นกำแพงน้ำแข็งล้อมรอบขอบโลกเอาไว้ จึงยังไม่เคยมีนักเดินทางคนใดตกขอบโลกตาย ท้องฟ้าด้านบนของโลกที่แบนราบมีดวงอาทิตย์และดวงจันทร์โคจรวนรอบกันและกัน โดยโลกไม่ได้มีส่วนเกี่ยวข้องกับการโคจรของดวงดาวในระบบสุริยะนี้เลย ทำให้น่าสงสัยว่าหากโลกมีรูปทรงเป็นจานแบนตามที่กล่าวมานี้จริง จะเกิดอะไรขึ้น ?"
    }
]
